#+BEGIN_COMMENT
.. title: Siamese Networks: Defining the Model
.. slug: siamese-networks-defining-the-model
.. date: 2021-01-25 19:36:23 UTC-08:00
.. tags: nlp,siamese networks
.. category: NLP
.. link: 
.. description: Defining the Siamese Network.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-06fdd9c5-dcd5-48bd-a67d-aa30e4e8da24-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Check the Model

#+begin_src python :results output :exports both
model = Siamese()
print(model)
#+end_src

#+RESULTS:
#+begin_example
Parallel_in2_out2[
  Serial[
    Embedding_77068_128
    LSTM_128
    Mean
    Normalize
  ]
  Serial[
    Embedding_77068_128
    LSTM_128
    Mean
    Normalize
  ]
]
#+end_example
** Check It Out
#+begin_src python :results output :exports both
from neurotic.nlp.siamese_networks import SiameseModel

model = SiameseModel(len(loader.vocabulary))
print(model.model)
#+end_src   

#+RESULTS:
#+begin_example
Parallel_in4_out2[
  Serial_in2[
    Embedding_77068_128
    LSTM_128
    Mean
    Normalize_in2
  ]
  Serial_in2[
    Embedding_77068_128
    LSTM_128
    Mean
    Normalize_in2
  ]
]
#+end_example
